chcp 65001
mkdir "Лабораторні\ПЗ-22-2\Безуглий В.Р\batch\Прихована папка"
mkdir "Лабораторні\ПЗ-22-2\Безуглий В.Р\batch\Не прихована папка"
attrib +h "Лабораторні\ПЗ-22-2\Безуглий В.Р\batch\Прихована папка"
help xcopy
help xcopy > "Лабораторні\ПЗ-22-2\Безуглий В.Р\batch\Не прихована папка\copyhelp.txt"
xcopy "Лабораторні\ПЗ-22-2\Безуглий В.Р\batch\Не прихована папка\copyhelp.txt" "Лабораторні\ПЗ-22-2\Безуглий В.Р\batch\Прихована папка\copied_copyhelp.txt" /Y
dir "Лабораторні\ПЗ-22-2\Безуглий В.Р\batch\Прихована папка"
pause