chcp 65001

@echo off

if "%~1"=="" (
    echo Ви не вказали шлях до каталогу.
    exit /b 1
) else (
    cd "%~1"
)

if not exist "%~1" (
  echo Каталог "%~1" не існує
  exit /b 2
)

echo Зміна атрибутів файлів у каталозі "%~1"
echo.
echo Синтаксис команди: %0 каталог [+a] [+r] [+h] [+s]
echo.
echo Параметри:
echo +a - встановлення атрибуту "архівний"
echo +r - встановлення атрибуту "тільки для читання"
echo +h - встановлення атрибуту "прихований"
echo +s - встановлення атрибуту "системний"


if "%~2"=="" (
    echo Ви не вказали параметри для зміни атрибутів файлів.
    exit /b 3
)

attrib "%~1\*" %~2 /s /d

echo Успішна зміна параметрів.
exit /b 0